pchwalek/env_glasses/STM32_WPAN/App/app_ble.c
      /* USER CODE BEGIN BLUE_EVT */

      /* USER CODE END BLUE_EVT */
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

      default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
    return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/

void bluetoothStartAdvertising(void){
	  /**
	  * Start to Advertise to be connected by Collector
	   */
	   Adv_Request(APP_BLE_FAST_ADV);
}

uint8_t isBluetoothConnected(void){
	if((BleApplicationContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT) ||
			(BleApplicationContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)){
		return 1;
	}else{
		return 0;
	}
}


uint8_t APP_BLE_ComputeCRC8(uint8_t *DataPtr, uint8_t Datalen) {
	uint8_t i, j;
	const uint8_t PolynomeCRC = 0x97;
	uint8_t CRC8 = 0x00;

	for (i = 0; i < Datalen; i++) {
		CRC8 ^= DataPtr[i];
		for (j = 0; j < 8; j++) {
			if ((CRC8 & 0x80) != 0) {
				CRC8 = (uint8_t) ((CRC8 << 1) ^ PolynomeCRC);
			} else {
				CRC8 <<= 1;
			}
		}
	}
	return (CRC8);
}

uint8_t index_con_int, mutex;
void BLE_SVC_L2CAP_Conn_Update_7_5(void) {
	/* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_1 */

	/* USER CODE END BLE_SVC_L2CAP_Conn_Update_1 */
//	if (mutex == 1) {
//		mutex = 0;
		uint16_t interval_min = CONN_P(7.5);
		uint16_t interval_max = CONN_P(7.5);
		uint16_t slave_latency = L2CAP_SLAVE_LATENCY;
		uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
		tBleStatus result;

		result = aci_l2cap_connection_parameter_update_req(
				BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
				interval_min, interval_max, slave_latency, timeout_multiplier);
		if (result == BLE_STATUS_SUCCESS) {
#if(CFG_DEBUG_APP_TRACE != 0)
			APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully \r\n\r");
#endif
		} else {
#if(CFG_DEBUG_APP_TRACE != 0)
			APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
#endif
		}
//	}
	/* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_2 */

	/* USER CODE END BLE_SVC_L2CAP_Conn_Update_2 */
	return;
}

void LinkConfiguration(void *argument) {
	UNUSED(argument);
	tBleStatus status;

	while (1) {
		osThreadFlagsWait(1, osFlagsWaitAny, osWaitForever);

#if (CFG_BLE_CENTRAL != 0)
		uint8_t tx_phy;
		uint8_t rx_phy;
#endif

		/**
		 * The client will start ATT configuration after the link is fully configured
		 * Setup PHY
		 * Setup Data Length
		 * Setup Pairing
		 */
#if (((CFG_TX_PHY == 2) || (CFG_RX_PHY == 2)) && (CFG_BLE_CENTRAL != 0))
		GapProcReq(GAP_PROC_SET_PHY);
#endif

#if (CFG_BLE_CENTRAL != 0)
		APP_DBG_MSG("Reading_PHY\n");
		status = hci_le_read_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,&tx_phy,&rx_phy);
		if (status != BLE_STATUS_SUCCESS)
		{
			APP_DBG_MSG("Read phy cmd failure: 0x%x \n", status);
		}
		else
		{
			APP_DBG_MSG("TX PHY = %d\n", tx_phy);
			APP_DBG_MSG("RX PHY = %d\n", rx_phy);
		}
#endif

		APP_DBG_MSG("set data length \n");
//		  BSP_LED_On(LED_BLUE);
		status = hci_le_set_data_length(
				BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
				251, 2120);
		if (status != BLE_STATUS_SUCCESS) {
//				  BSP_LED_On(LED_RED);
			APP_DBG_MSG("set data length command error \n");
		}

#if ((CFG_ENCRYPTION_ENABLE != 0) && (CFG_BLE_CENTRAL != 0))
		GapProcReq(GAP_PROC_PAIRING);
#endif

		DTC_App_LinkReadyNotification(
				BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
	}
}

/* USER CODE END FD*/
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init( void )
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  MtxHciId = osMutexNew( NULL );
  SemHciId = osSemaphoreNew( 1, 0, NULL ); /*< Create the semaphore and make it busy at initialization */

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

static void Ble_Hci_Gap_Gatt_Init(void){

  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *bd_addr;
  uint16_t appearance[1] = { BLE_CFG_GAP_APPEARANCE };

  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
  hci_reset();

  /**
   * Write the BD Address
   */

  bd_addr = BleGetBdAddress();
  aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                            CONFIG_DATA_PUBADDR_LEN,
                            (uint8_t*) bd_addr);

#if (CFG_BLE_ADDRESS_TYPE == PUBLIC_ADDR)
  /* BLE MAC in ADV Packet */
  manuf_data[ sizeof(manuf_data)-6] = bd_addr[5];
  manuf_data[ sizeof(manuf_data)-5] = bd_addr[4];
  manuf_data[ sizeof(manuf_data)-4] = bd_addr[3];
  manuf_data[ sizeof(manuf_data)-3] = bd_addr[2];
  manuf_data[ sizeof(manuf_data)-2] = bd_addr[1];
  manuf_data[ sizeof(manuf_data)-1] = bd_addr[0];
#endif

  /**
   * Write Identity root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET,
    CONFIG_DATA_IR_LEN,
                            (uint8_t*) BLE_CFG_IR_VALUE);

  /**
   * Write Encryption root key used to derive LTK and CSRK
   */
    aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET,
                              CONFIG_DATA_ER_LEN,
                              (uint8_t*) BLE_CFG_ER_VALUE);

  /**
   * Static random Address
   * The two upper bits shall be set to 1
   * The lowest 32bits is read from the UDN to differentiate between devices
   * The RNG may be used to provide a random number on each power on
   */
#if defined(CFG_STATIC_RANDOM_ADDRESS)
  srd_bd_addr[0] = CFG_STATIC_RANDOM_ADDRESS & 0xFFFFFFFF;
  srd_bd_addr[1] = (uint32_t)((uint64_t)CFG_STATIC_RANDOM_ADDRESS >> 32);
  srd_bd_addr[1] |= 0xC000; /* The two upper bits shall be set to 1 */
#elif (CFG_BLE_ADDRESS_TYPE == RANDOM_ADDR)
  /* Get RNG semaphore */
  while( LL_HSEM_1StepLock( HSEM, CFG_HW_RNG_SEMID ) );

  /* Enable RNG */
  __HAL_RNG_ENABLE(&hrng);

  /* Enable HSI48 oscillator */
  LL_RCC_HSI48_Enable();
  /* Wait until HSI48 is ready */
  while( ! LL_RCC_HSI48_IsReady( ) );

  if (HAL_RNG_GenerateRandomNumber(&hrng, &srd_bd_addr[1]) != HAL_OK)
  {
    /* Random number generation error */
    Error_Handler();
  }
  if (HAL_RNG_GenerateRandomNumber(&hrng, &srd_bd_addr[0]) != HAL_OK)
  {
    /* Random number generation error */
    Error_Handler();
  }
  srd_bd_addr[1] |= 0xC000; /* The two upper bits shall be set to 1 */

  /* Disable HSI48 oscillator */
  LL_RCC_HSI48_Disable();

  /* Disable RNG */
  __HAL_RNG_DISABLE(&hrng);

  /* Release RNG semaphore */
  LL_HSEM_ReleaseLock( HSEM, CFG_HW_RNG_SEMID, 0 );
#endif

#if (CFG_BLE_ADDRESS_TYPE == STATIC_RANDOM_ADDR)
  /* BLE MAC in ADV Packet */
  manuf_data[ sizeof(manuf_data)-6] = srd_bd_addr[1] >> 8 ;
  manuf_data[ sizeof(manuf_data)-5] = srd_bd_addr[1];
  manuf_data[ sizeof(manuf_data)-4] = srd_bd_addr[0] >> 24;
  manuf_data[ sizeof(manuf_data)-3] = srd_bd_addr[0] >> 16;
  manuf_data[ sizeof(manuf_data)-2] = srd_bd_addr[0] >> 8;
  manuf_data[ sizeof(manuf_data)-1] = srd_bd_addr[0];

  aci_hal_write_config_data( CONFIG_DATA_RANDOM_ADDRESS_OFFSET, CONFIG_DATA_RANDOM_ADDRESS_LEN, (uint8_t*)srd_bd_addr );
#endif

  /**
   * Write Identity root key used to derive LTK and CSRK
   */
  aci_hal_write_config_data( CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, (uint8_t*)BLE_CFG_IR_VALUE );

  /**
   * Write Encryption root key used to derive LTK and CSRK
   */
  aci_hal_write_config_data( CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN, (uint8_t*)BLE_CFG_ER_VALUE );

  /**
   * Set TX Power to 0dBm.
   */
  aci_hal_set_tx_power_level(1, CFG_TX_POWER);

  /**
   * Initialize GATT interface
   */
  aci_gatt_init();

  /**
   * Initialize GAP interface
   */
  role = 0;

